import java.util.Scanner;

public class Test {
    /**
     * Самостоятельная задача
     *     Создать метод, в котором будем спрашивать возраст.
     *     Создать еще три метода для возрастных групп: до 18, от 18 до 40, от 40.
     *     В первом методе спросить в какие игры играет человек
     *     Во втором спросить сколько человек зарабатывает
     *     В третьем спросить есть ли у человека автомобиль
     */

    static Scanner sc = new Scanner(System.in);
    public static void main(String[] args) {
        String str = "Hello";
        System.out.println(str.hashCode());
    }

    public static String from40() {
        return sc.nextLine();
    }
}
